#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:369168831564:cluster/ecs-fargate]
aws_apigatewayv2_api.apigw_http_endpoint: Refreshing state... [id=kkl2hjkul9]
data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01fff0957ca47e89f]
module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=ecs-fargate]
aws_apigatewayv2_stage.apigw_stage: Refreshing state... [id=$default]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-029d6619b5d312fc5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c490266581cf60ea]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0f80f6de7b9dc4d7a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0055f9b92420f0255]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0445888f30e75c23f]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-02f3a7b404fe60aef]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-037de480b5563395e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a5e0f4aef71171f7]
aws_security_group_rule.sg_egress_rule_lb_to_ecs_cluster: Refreshing state... [id=sgrule-3662990362]
aws_security_group_rule.sg_ingress_rule_ecs_cluster_from_lb: Refreshing state... [id=sgrule-1438586603]
aws_security_group_rule.sg_ingress_rule_all_to_lb: Refreshing state... [id=sgrule-545846465]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-072b6968bf97eee88]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01895e9280a516fa5]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fcfdf047bb0be1b5]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230111180151339500000004/ccd1a360c78d599d]
aws_apigatewayv2_vpc_link.vpclink_apigw_to_alb: Refreshing state... [id=dzo61c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_vpc_endpoint.ecr-dkr-endpoint will be created
  + resource "aws_vpc_endpoint" "ecr-dkr-endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-029d6619b5d312fc5",
        ]
      + service_name          = "com.amazonaws..ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-037de480b5563395e",
          + "subnet-0a5e0f4aef71171f7",
          + "subnet-0c490266581cf60ea",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-01fff0957ca47e89f"

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf_plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf_plan"

```

</details>

*Pusher: @liamfit, Action: `pull_request`, Workflow: `Terraform`*